
int ledPin = 2;

int digitalPin = 18;

int val = 0;

void setup() {

  pinMode(ledPin, OUTPUT);  // sets the pin as output

  pinMode(digitalPin, INPUT); // sets the pin as input

  Serial.begin(9600);

}



void loop() {

  val = digitalRead(digitalPin);  //อ่านค่าสัญญาณ digital ขา8 ที่ต่อกับ เซ็นเซอร์ตรวจจับวัตถุ IR Infrared

  Serial.print("val = "); // พิมพ์ข้อมความส่งเข้าคอมพิวเตอร์ "val = "

  Serial.println(val); // พิมพ์ค่าของตัวแปร val

  if (val == 0) { // ค่า เป็น 0  ตรวจจับเจอวัตถุ สั่งให้ไฟ LED ติด

    digitalWrite(ledPin, HIGH); // สั่งให้ LED ติดสว่าง

  }

  else {

    digitalWrite(ledPin, LOW); // สั่งให้ LED ดับ

  }

  delay(100);

}

//
ใช้เซนเซอร์ตรวจจับกระดาษได้ในระยะ 11 ซม. แต่ถ้าหากอยากให้จับในระยะ 15 ซม.ใช้ไขควงหมุนจนเซนเซอร์สามารถจับได้ในระยะ 15 ซม.
แล้วได้ทดลองกับวัตถุชนิดต่างๆ 5 ชนิด ได้แก่
 1.โทรศัพท์เคสสีเขียว จับได้ในระยะ 11 ซม.
 2.ขวดน้ำ จับได้ในระยะ 12 ซม.
 3.ถุงกระเป๋าผ้าสีชมพู จับได้ในระยะ 9 ซม.
 4.เมาส์สีแดง จับได้ในระยะ 10 ซม.
 5.หมวกสีแดง จับได้ในระยะ 8 ซม.
 ซึ่งจากการทดลองพบว่าวัตถุอื่นๆจับระยะได้น้อยกว่า 15 ซม.เพราะกระดาษสีขาวสะท้อนแสงได้ดีกว่า
